"""
Задача: последняя цифра большого числа Фибоначчи

Дано число 1 ≤ n ≤ 10^7, необходимо найти последнюю цифру n-го числа Фибоначчи.

Как мы помним, числа Фибоначчи растут очень быстро, поэтому при их вычислении нужно
быть аккуратным с переполнением.В данной задаче, впрочем, этой проблемы можно избежать,
поскольку нас интересует только последняя цифра числа Фибоначчи:
если 0 ≤ a, b ≤ 9 — последние цифры чисел Fi и Fi+1 соответственно,
то (a + b) % 10 — последняя цифра числа Fi+2.

Sample Input:
841645
Sample Output:
5
"""

def fib_digit(n):
    fib = [0, 1]

    for i in range(1, n):
        x = (fib[i] + fib[i-1]) % 10
        fib.append(x)

    return fib[n]


def main():
    n = int(input())
    print(fib_digit(n))


if __name__ == "__main__":
    main()